# Importante

- Añadir a cada grafico un texto tipo Observaciones explicando como se tiene que interpretar la información.

- Hay que terminar con conclusiones

# Introducción

El objetivo de este proyecto es la implementación de las primeras fases típicas de un proyecto de ciencia de datos, que son:
1. Recolección de datos
2. Limpieza de datos
3. Análisis de datos

## Cosas instalación previa

- python -m ipykernel install --user --name=venv_dataset_project --display-name

## Hipotesis que se desean demostrar con los datos

- Normalización de salarios con respecto al coste de vida de los países.
- ¿Cuál es el país con

# Fuentes de dataset

- Puestos de trabajos relacionados con IA: https://www.kaggle.com/datasets/bismasajjad/global-ai-job-market-and-salary-trends-2025/data
- Puestos de trabajos a nivel tecnológico: https://www.kaggle.com/datasets/yaaryiitturan/global-tech-salary-dataset

- Análisis de coste de vida: https://www.kaggle.com/datasets/myrios/cost-of-living-index-by-country-by-number-2024
- Salario promedio por países: https://www.kaggle.com/datasets/meeratif/list-of-countries-by-average-wage-monthly-yearly
- Indice de desarrollo humano: https://hdr.undp.org/data-center/documentation-and-downloads

## Cargado de datos y primera toma de contacto

In [196]:
import pandas as pd
import os

path_ai_jobs = os.path.join('data','ai_job_dataset.csv')
path_global_tech = os.path.join('data', 'global_tech_salary.txt')
path_cost_of_living = os.path.join('data', 'Cost_of_Living_Index_by_Country_2024.csv')
path_avg_salary = os.path.join('data', 'salary_data.csv')
path_idh = os.path.join('data', 'HDR25_Statistical.xlsx')

ai_job_df = pd.read_csv(path_ai_jobs, sep=',')
global_tech_df = pd.read_csv(path_global_tech, sep=',')
cost_of_life_df = pd.read_csv(path_cost_of_living, sep=',')
avg_salary_df = pd.read_csv(path_avg_salary, sep=',')
idh_df = pd.read_excel(path_idh, sheet_name='Table 1. HDI')

print('========================== OFERTAR LABORALES EN IA ===========================')
# Pasamos de snake_case a Title Case y quitamos guiones bajos
ai_job_df.columns = ai_job_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Employee Residence' a 'Country' para unificar con los otros DataFrames
ai_job_df = ai_job_df.rename(columns={'Employee Residence': 'Country'})
ai_job_df = ai_job_df.rename(columns={'Salary Usd': 'Salary USD'})
display(ai_job_df.sample(5))

print('========================== OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL ==========================')
global_tech_df.columns = global_tech_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Country or Area' a 'Country' para unificar con los otros DataFrames
global_tech_df = global_tech_df.rename(columns={'Employee Residence': 'Country'})
global_tech_df = global_tech_df.rename(columns={'Salary In Usd': 'Salary USD'})
display(global_tech_df.sample(5))

print('========================== COSTE DE VIDA POR PAÍSES ==========================')
display(cost_of_life_df.sample(5))

print('========================== SALARIO PROMEDIO POR PAÍSES ==========================')
# Pasamos de snake_case a Title Case y quitamos guiones bajos

avg_salary_df.columns = avg_salary_df.columns.str.replace('_', ' ').str.title().str.strip()
avg_salary_df = avg_salary_df.rename(columns={'Country Name': 'Country'})
display(avg_salary_df.sample(5))

print('========================== ÍNDICE DE DESARROLLO HUMANO (IDH) ==========================')
idh_df.columns = idh_df.columns.str.replace('_', ' ').str.title().str.strip()
idh_df = idh_df.rename(columns={'Country or Area': 'Country'})
idh_df = idh_df.rename(columns={'Human Development Index (Hdi)': 'Human Development Index'})
display(idh_df.sample(5))

========================== OFERTAR LABORALES EN IA ===========================

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
11050,AI11051,ML Ops Engineer,228723,EUR,EX,FL,Netherlands,L,Netherlands,100,"Docker, Kubernetes, Tableau, Scala",PhD,13,Real Estate,2025-01-01,2025-02-20,2483,7.8,Machine Intelligence Group
10954,AI10955,Machine Learning Researcher,130679,USD,SE,FL,Denmark,S,Denmark,0,"Data Visualization, AWS, GCP, Scala, Java",Associate,7,Automotive,2024-08-12,2024-10-24,1660,7.6,Advanced Robotics
12140,AI12141,AI Architect,40011,USD,EN,FT,India,S,United Kingdom,100,"Java, PyTorch, Tableau",Master,0,Automotive,2024-10-04,2024-11-05,998,8.0,AI Innovations
12913,AI12914,Research Scientist,133903,USD,EX,FL,Canada,M,Canada,100,"Data Visualization, Java, Scala, AWS, Docker",Master,15,Government,2024-04-03,2024-06-10,1157,6.1,DataVision Ltd
4032,AI04033,ML Ops Engineer,261262,USD,EX,FL,Switzerland,L,Switzerland,0,"Python, Deep Learning, Statistics, Spark, GCP",Associate,14,Consulting,2025-04-30,2025-07-01,1590,9.3,Neural Networks Co

========================== OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL ==========================

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
3128,2022,MI,FT,Data Scientist,200000,USD,200000,US,100,US,M
359,2023,SE,FT,Data Analyst,158494,USD,158494,US,100,US,M
3475,2023,SE,FT,Data Scientist,168000,USD,168000,US,100,US,M
848,2023,MI,FT,Data Scientist,111024,CAD,82254,CA,100,CA,L
1736,2023,SE,FT,Data Engineer,122000,USD,122000,US,0,US,M

========================== COSTE DE VIDA POR PAÍSES ==========================

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
25,26,Italy,56.2,19.2,38.5,57.0,53.3,78.3
86,87,Azerbaijan,31.2,8.7,20.4,29.0,31.8,37.2
97,98,Argentina,29.4,7.6,18.9,29.7,24.8,41.5
5,6,Norway,76.0,26.2,52.1,79.0,73.5,114.7
104,105,Bolivia,27.6,7.5,18.0,27.0,19.4,37.9

========================== SALARIO PROMEDIO POR PAÍSES ==========================

,Country,Continent Name,Wage Span,Median Salary,Average Salary,Lowest Salary,Highest Salary
198,Togo,Africa,Monthly,787.96,852.41,214.31,3786.72
183,Solomon Islands,Oceania,Monthly,644.89,756.53,191.21,3361.05
162,Puerto Rico,Caribbean,Monthly,1483.00,1683.00,425.00,7491.00
122,Maldives,Asia,Monthly,1099.61,1241.91,313.07,5517.46
75,Ghana,Africa,Monthly,373.82,438.42,110.25,1946.60

========================== ÍNDICE DE DESARROLLO HUMANO (IDH) ==========================

,Hdi Rank,Country,Human Development Index,Life Expectancy At Birth,Expected Years Of Schooling,Mean Years Of Schooling,Gross National Income (Gni) Per Capita,Gni Per Capita Rank Minus Hdi Rank,Hdi Rank.1
178,179,Guinea,0.500,60.740,10.393306,2.486339,3494.347723,-16,179
97,98,Dominica,0.761,71.132,14.151000,10.125090,16001.125510,-2,98
61,62,Costa Rica,0.833,80.799,16.349637,8.844752,23417.213150,6,65
20,21,Slovenia,0.931,81.603,17.477171,12.951202,46360.807790,15,21
99,100,Egypt,0.754,71.633,13.127162,10.136120,16218.135210,-7,100

## Datos representativos de los datasets objeto de estudio

In [197]:
summary_df = pd.DataFrame({
    'Dataset asociado': ['Puestos de trabajo IA', 'Global Tech Salary', 'Coste de vida', 'Salario promedio por países', 'Indice de Desarrollo Humano (IDH)'],
    'Número de entradas': [len(ai_job_df), len(global_tech_df), len(cost_of_life_df), len(avg_salary_df), len(idh_df)],
    'Número de columnas': [ai_job_df.shape[1], global_tech_df.shape[1], cost_of_life_df.shape[1], avg_salary_df.shape[1], idh_df.shape[1]],
    'Columnas Categóricas': [
        ai_job_df.select_dtypes(include='object').shape[1],
        global_tech_df.select_dtypes(include='object').shape[1],
        cost_of_life_df.select_dtypes(include='object').shape[1],
        avg_salary_df.select_dtypes(include='object').shape[1],
        idh_df.select_dtypes(include='object').shape[1],
    ],
    'Columnas Numéricas': [
        ai_job_df.select_dtypes(include='number').shape[1],
        global_tech_df.select_dtypes(include='number').shape[1],
        cost_of_life_df.select_dtypes(include='number').shape[1],
        avg_salary_df.select_dtypes(include='number').shape[1],
        idh_df.select_dtypes(include='number').shape[1],
    ],
        'Nulos totales': [
        ai_job_df.isnull().sum().sum(),
        global_tech_df.isnull().sum().sum(),
        cost_of_life_df.isnull().sum().sum(),
        avg_salary_df.isnull().sum().sum(),
        idh_df.isnull().sum().sum()
    ],
    'Filas duplicadas': [
        ai_job_df.duplicated().sum(),
        global_tech_df.duplicated().sum(),
        cost_of_life_df.duplicated().sum(),
        avg_salary_df.duplicated().sum(),
        idh_df.duplicated().sum()
    ],
    'Número países implicados': [
        ai_job_df['Country'].nunique(),
        global_tech_df['Country'].nunique(),
        cost_of_life_df['Country'].nunique(),
        avg_salary_df['Country'].nunique(),
        idh_df['Country'].nunique()
    ]
    })

display(summary_df)

,Dataset asociado,Número de entradas,Número de columnas,Columnas Categóricas,Columnas Numéricas,Nulos totales,Filas duplicadas,Número países implicados
0,Puestos de trabajo IA,15000,19,14,5,0,0,20
1,Global Tech Salary,5000,11,7,4,0,1144,55
2,Coste de vida,121,8,1,7,0,0,121
3,Salario promedio por países,221,7,3,4,0,0,221
4,Indice de Desarrollo Humano (IDH),193,9,2,7,0,0,193

<b>Primeras conclusiones</b>
- El dataset puestos de trabajos en IA es rico en datos teniendo 15.000 entradas y 19 columnas, lo cual, nos proporcionará una buena base para tener una visión general del mercado laboral en IA.
- Los datasets de costes de vida, salario promedio por países e índice de desarrollo humano tienen un número de entradas coherentes con el número de países que existen en el mundo, aunque hay uqe subrayar que el dataset "Coste de vida" tiene un número de entradas inferior, por lo que no se podrá hacer una comparación directa con todos los países, sino que habrá que hacer una selección de los páises que están en común entre los cuatro datasets.
- No hay valores nulos ni filas duplicadas en los datasets, lo cual es positivo para el análisis posterior.

A continuación, nos centraremos en averiguar qué países quedarán expluidos de la comparación por no tener datos en todos los datasets.

## Limpieza de datos y normalización de datos

<b>Cambios básicos</b><br>

Empezamos con una eliminación de duplicados en el dataset de puestos de trabajos en IA, ya que hay entradas duplicadas. Esto es importante para evitar sesgos en el análisis posterior. Además, ponemos los nombres de los países en minúsculas para facilitar la comparación con los otros datasets.

In [198]:
# Eliminamos duplicados y reseteamos el índice en global_tech_df
global_tech_df = global_tech_df.drop_duplicates().reset_index(drop=True)

# Ponemos nombres de países en minúsculas y sin espacios extra
ai_job_df['Country'] = ai_job_df["Country"].str.strip().str.lower()
cost_of_life_df['Country'] = cost_of_life_df["Country"].str.strip().str.lower()
avg_salary_df['Country'] = avg_salary_df["Country"].str.strip().str.lower()
idh_df['Country'] = idh_df["Country"].str.strip().str.lower()
global_tech_df['Country'] = global_tech_df["Country"].str.strip().str.lower()

<b>Nombres de países en el dataset "Global Tech Salary"</b>

Tenemos un caso especial donde los nombres de páises en el dataset "Global Tech Salary" no coinciden con los nombres de países en los otros datasets. Por ejemplo, "USA" en lugar de "united states". Para solucionar esto, crearemos un diccionario de mapeo para normalizar los nombres de países utilizando la librería de terceros "pycountry" para obtener los nombres oficiales de los países y según su código ISO.

In [199]:
import pycountry # Módulo para obtener nombres de países segun codigo
global_tech_df["Country"].unique()

def codigo_a_nombre(codigo):
    try:
        return pycountry.countries.get(alpha_2=codigo).name.strip().lower()
    except:
        return codigo
    
global_tech_df["Country"] = global_tech_df["Country"].map(codigo_a_nombre)

display(global_tech_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
2575,2024,SE,FT,Data Analyst,82620,USD,82620,united states,0,US,M
1359,2024,SE,FT,AI Engineer,85000,USD,85000,united states,100,US,M
547,2023,SE,FT,Data Analyst,240500,USD,240500,united states,0,US,M
2801,2023,MI,FT,Data Analyst,111151,USD,111151,united states,100,US,M
1810,2024,MI,FT,Data Scientist,127300,USD,127300,united states,0,US,L

<b>Nivel de experiencia y tipo de trabajo</b>

Continuamos expandiendo los acrónimos de los niveles de experiencia y tipos de trabajo en el dataset "Global Tech Salary". Por ejemplo, "Jr" se convierte en "Junior", "Sr" en "Senior", y así sucesivamente. Esto nos permitirá tener una mejor comprensión de los datos y facilitará el análisis posterior.

In [200]:
EXPERIENCE_LEVEL_MAP = {
    "EN": "Entry-level",
    "MI": "Mid-level",
    "SE": "Senior-level",
    "EX": "Executive-level",
}

EMPLOYMENT_TYPE_MAP = {
    "FT": "Full-time",
    "PT": "Part-time",
    "CT": "Contract",
    "FL": "Freelance",
    "IN": "Internship",
}

COMPANY_SIZE_MAP = {
    "S": "Small",
    "M": "Medium",
    "L": "Large",
}

global_tech_df['Experience Level'] = global_tech_df['Experience Level'].map(lambda  exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
global_tech_df['Employment Type'] = global_tech_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
global_tech_df['Company Size'] = global_tech_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

ai_job_df["Experience Level"] = ai_job_df["Experience Level"].map(lambda exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
ai_job_df["Employment Type"] = ai_job_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
ai_job_df["Company Size"] = ai_job_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

display(global_tech_df.sample(5))
display(ai_job_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
2294,2024,Senior-level,Full-time,Data Scientist,81410,USD,81410,canada,0,CA,Medium
3195,2023,Senior-level,Full-time,Research Engineer,170112,USD,170112,united states,0,US,Medium
970,2023,Senior-level,Full-time,Data Engineer,290000,USD,290000,united states,100,US,Medium
3046,2022,Mid-level,Full-time,Research Engineer,100000,EUR,105066,united kingdom,50,GB,Small
3591,2024,Executive-level,Full-time,Data Science Director,212000,USD,212000,united states,0,US,Medium

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
8501,AI08502,AI Specialist,165249,USD,Senior-level,Contract,United States,Large,united states,50,"Kubernetes, Statistics, Data Visualization, SQL",Associate,6,Automotive,2024-11-02,2025-01-04,586,9.7,Advanced Robotics
4587,AI04588,Head of AI,105012,USD,Senior-level,Freelance,Ireland,Medium,ireland,100,"AWS, Git, TensorFlow, Java, SQL",Master,6,Healthcare,2024-12-02,2025-01-15,1074,5.3,Quantum Computing Inc
9160,AI09161,Principal Data Scientist,137826,USD,Senior-level,Part-time,Australia,Medium,sweden,0,"R, Scala, Java, Data Visualization",Bachelor,9,Consulting,2025-03-20,2025-04-27,565,6.3,Cloud AI Solutions
5995,AI05996,Machine Learning Researcher,126033,USD,Executive-level,Freelance,China,Medium,japan,0,"NLP, TensorFlow, R, Mathematics, AWS",PhD,17,Consulting,2025-04-09,2025-06-03,1282,9.0,Algorithmic Solutions
13695,AI13696,Data Scientist,94509,USD,Senior-level,Part-time,Israel,Small,israel,100,"SQL, Git, Python, Computer Vision",Associate,7,Real Estate,2024-07-19,2024-08-27,1617,8.7,Cognitive Computing

## Unificación de datasets
<b>Selección de información relevante para el estudio</b>

Dado que queremos hacer una unión vertical de los datasets, es necesario seleccionar las columnas que son comunes entre ellos. En este caso, las columnas relevantes son:
- "Job title" (título del trabajo).
- "Country" (país).
- "Salary In Usd" (salario): En el primer dataset cogeremos el salario normalizado a USD.
- "Nivel de experiencia" (nivel de experiencia).
- "Tipo de trabajo" (tipo de trabajo).

In [201]:
common_columns = list(set(global_tech_df.columns) & set(ai_job_df.columns))

global_tech_reduced = global_tech_df[common_columns]
ai_job_reduced = ai_job_df[common_columns]

all_tech_jobs_df = pd.concat([global_tech_reduced, ai_job_reduced], ignore_index=True)
display(all_tech_jobs_df.sample(10))

,Salary Currency,Experience Level,Employment Type,Job Title,Salary USD,Company Size,Country,Company Location,Remote Ratio
7280,GBP,Mid-level,Part-time,Deep Learning Engineer,94569,Medium,united kingdom,United Kingdom,50
14903,USD,Mid-level,Part-time,NLP Engineer,59806,Large,austria,Austria,50
14199,USD,Entry-level,Contract,Machine Learning Researcher,51135,Small,south korea,South Korea,100
9167,USD,Executive-level,Contract,Data Engineer,170391,Medium,israel,Israel,100
9043,USD,Executive-level,Freelance,Computer Vision Engineer,218544,Medium,ireland,Australia,100
17430,GBP,Executive-level,Full-time,Head of AI,238984,Medium,united kingdom,United Kingdom,0
8895,USD,Senior-level,Contract,AI Research Scientist,179668,Medium,norway,Norway,100
18613,USD,Senior-level,Part-time,Machine Learning Researcher,73465,Medium,germany,Austria,0
9360,USD,Senior-level,Freelance,AI Architect,88883,Small,austria,Austria,0
16367,USD,Entry-level,Contract,Head of AI,72522,Small,united states,United States,50

<b>Eliminación de información no representativa</b>

Continuamos eliminando los registros asociados con los países que no tienen suficientes ofertas de trabajo, dado que puede sesgar de manera negativa nuestra interpretación de los datos. Para ello, eliminamos los países que tienen menos de 10 ofertas de trabajo en el dataset de puestos de trabajos en IA.

In [202]:
MINIMU_OFFERS = 10

countries_with_few_jobs = all_tech_jobs_df.groupby('Country').filter(lambda x: len(x) < MINIMU_OFFERS)['Country'].unique()
all_tech_jobs_df = all_tech_jobs_df[~all_tech_jobs_df['Country'].isin(countries_with_few_jobs)]

<b>Unión de datasets de coste de vida, índice de desarrollo humano y salarío promedio por país</b>

En primer lugar solo seleccionaremos los campos que nos interesan de cada dataset, tras esto procederemos a unificar los datasets de coste de vida, índice de desarrollo humano y salario promedio por país. Para ello, utilizaremos la columna "Country" como clave de unión. Esto nos permitirá tener una visión más completa de los datos y facilitará el análisis posterior. Finalmente, eliminaremos todos aquellos países que no estén presente en la tabla de puestos de trabajos tecnológicos.

In [203]:
life_cost_reduced = cost_of_life_df[['Country', 'Cost of Living Index']]
avg_salary_reduced = avg_salary_df.drop(columns=['Continent Name', 'Wage Span'])
idh_reduced = idh_df[['Country', 'Human Development Index']]

countries_in_jobs_df = all_tech_jobs_df['Country'].unique()
display(countries_in_jobs_df)

indicators_by_country = pd.merge(pd.merge(life_cost_reduced, avg_salary_reduced, on='Country', how='outer'), idh_reduced, on='Country', how='outer')
indicators_by_country = indicators_by_country[indicators_by_country['Country'].isin(countries_in_jobs_df)]

display(indicators_by_country.sample(10))

array(['australia', 'united states', 'ireland', 'portugal',
       'united kingdom', 'germany', 'india', 'spain', 'netherlands',
       'canada', 'denmark', 'japan', 'france', 'brazil', 'switzerland',
       'sweden', 'finland', 'singapore', 'austria', 'china',
       'south korea', 'norway', 'israel'], dtype=object)

,Country,Cost of Living Index,Median Salary,Average Salary,Lowest Salary,Highest Salary,Human Development Index
28,brazil,30.2,1490.04,1711.16,432.27,7609.56,0.786
107,israel,62.7,NaN,NaN,NaN,NaN,0.919
207,south korea,60.1,NaN,NaN,NaN,NaN,NaN
110,japan,46.1,3158.67,3453.12,869.97,15391.82,0.925
59,denmark,72.3,5084.99,5779.04,1458.92,25637.39,0.962
169,norway,76.0,4420.02,4786.34,1208.23,21281.57,0.970
209,spain,47.3,2579.28,2875.26,877.38,12050.74,0.918
201,singapore,76.7,5647.06,6235.29,1573.53,27720.59,0.946
74,finland,63.2,4238.90,4978.86,1257.93,22093.02,0.948
101,india,21.2,327.97,384.43,97.07,1717.92,0.685

## Análisis de los datos
### Análisis superficial de empleo tecnológico

In [204]:
# ¿Cuantos países únicos hay en el DataFrame combinado?
unique_countries = all_tech_jobs_df['Country'].nunique()
print("PREGUNTAS BÁSICAS")

pair_question_answer = [
    ('¿Cuántos países están implicados en el estudio?', all_tech_jobs_df['Country'].nunique()),
    ('¿Cual es el salario más alto?', round(all_tech_jobs_df['Salary USD'].max(),2)),
    ('¿Qué puesto de trabajo tiene el salario más alto?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].max()]['Job Title'].unique().tolist()[0]),
    ('¿Que país tiene el salario más alto?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].max()]['Country'].unique().tolist()[0]),
    ('¿Cual es el salario más bajo?', round(all_tech_jobs_df['Salary USD'].min(),2)),
    ('¿Que puesto de trabajo tiene el salario más bajo?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].min()]['Job Title'].unique().tolist()[0]),
    ('¿Que país tiene el salario más bajo?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].min()]['Country'].unique().tolist()[0]),
    ('¿Cual es el salario promedio?', round(all_tech_jobs_df['Salary USD'].mean(),2)),
]

job_questions_df = pd.DataFrame(pair_question_answer, columns=['Pregunta', 'Respuesta'])
job_questions_df.set_index('Pregunta', inplace=True)
display(job_questions_df)

PREGUNTAS BÁSICAS

                                                       Respuesta
Pregunta
¿Cuántos países están implicados en el estudio?               23
¿Cual es el salario más alto?                             750000
¿Qué puesto de trabajo tiene el salario más alto?  Data Engineer
¿Que país tiene el salario más alto?               united states
¿Cual es el salario más bajo?                              15809
¿Que puesto de trabajo tiene el salario más bajo?   Data Analyst
¿Que país tiene el salario más bajo?                       india
¿Cual es el salario promedio?                          122168.65

<b>Analísis estadístico</b>

In [ ]:
salary_stats_by_country = all_tech_jobs_df.groupby('Country')['Salary USD'].agg(
    Max_Salary='max',
    Min_Salary='min',
    Avg_Salary='mean',
    Median_Salary='median',
    Std_Dev_Salary='std',
    Count_Offers='count'
).round(2).sort_values(by='Avg_Salary', ascending=False)
display(salary_stats_by_country)

,Max_Salary,Min_Salary,Avg_Salary,Median_Salary,Std_Dev_Salary,Count_Offers
Country,,,,,,
united states,750000,24000,152976.22,143497.0,67194.62,4001
switzerland,399095,32692,152700.41,133978.0,74606.69,749
denmark,381575,28609,149662.23,128975.0,75372.60,779
norway,371087,34254,143997.73,125521.0,68060.38,726
singapore,372206,36295,124324.78,110284.0,56761.07,742
netherlands,322318,35429,122599.88,107969.0,58097.36,767
canada,366957,35504,121319.16,109578.0,58317.71,872
sweden,326260,34357,120646.96,105387.0,57791.18,791
australia,341146,34323,118550.43,102204.0,58114.28,743
germany,341883,34174,118092.62,103743.0,54445.39,803
united kingdom,322015,28299,116878.36,102621.0,57819.87,933
france,357880,20000,114259.81,101656.5,53237.01,802
israel,338393,33503,96715.84,85440.0,47573.46,731
austria,344427,32542,96668.06,83492.0,51627.72,777
japan,353055,33092,96365.89,85514.0,49735.92,703
ireland,336333,33218,95858.08,81420.0,50303.55,747
south korea,349508,32666,95556.35,82885.0,49769.19,763
finland,361718,32977,95157.38,84973.0,46353.98,711
india,356015,15809,92071.18,80880.0,49788.76,793
china,332938,33013,91990.80,79723.0,47066.81,761
brazil,115000,19910,67891.00,69000.0,34139.47,10
spain,253750,21593,61036.94,52634.0,39490.55,34
portugal,95000,21593,48050.54,42026.0,21553.75,13

Procedemos a eliminar los países que tienen menos de 30 ofertas laborales, ya que esto nos permitirá centrarnos en los países con una cantidad significativa de datos. Esto es importante para evitar sesgos en el análisis posterior y asegurarnos de que los resultados sean representativos.

## Respondiendo a preguntas
### ¿Qué países salen en las ofertas de trabajo en IA?

In [206]:
print("Número de páises objeto de estudio: ", len(ai_job_df["Country"].unique()))  # Número de países únicos en el DataFrame de trabajos IA
print("Países objeto de estudio: ", ai_job_df["Country"].unique())  # Lista de países únicos en el DataFrame de trabajos IA

Número de páises objeto de estudio:  20
Países objeto de estudio:  ['china' 'ireland' 'south korea' 'india' 'singapore' 'germany'
 'united kingdom' 'france' 'austria' 'sweden' 'norway' 'israel'
 'united states' 'netherlands' 'denmark' 'switzerland' 'finland' 'japan'
 'canada' 'australia']